; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	spectrograph2 - mode
	infrared0 - mode
	image1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared0)
	(supports instrument9 image1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star3)
	(supports instrument10 image1)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 Star4)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 infrared0)
	(supports instrument12 image1)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon6)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 Star9)
	(pointing satellite4 GroundStation1)
	(pointing satellite5 Star5)
	(pointing satellite6 GroundStation1)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 image1)
	(have_image Star7 image1)
	(have_image Star8 spectrograph2)
	(have_image Star9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Star11 spectrograph2)
))

)

; plan
1. (turn_to satellite6 groundstation1 phenomenon6)
   deleted: (pointing satellite6 phenomenon6)
   added: (pointing satellite6 groundstation1)
   goals met: 1 of 12
2. (turn_to satellite5 star5 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 star5)
   goals met: 2 of 12
3. (turn_to satellite4 groundstation1 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 groundstation1)
   goals met: 3 of 12
4. (turn_to satellite2 star9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star9)
   goals met: 4 of 12
5. (turn_to satellite1 groundstation0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 12
6. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 12
7. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 4 of 12
8. (turn_to satellite1 star11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star11)
   goals met: 4 of 12
9. (take_image satellite1 star11 instrument1 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 5 of 12
10. (turn_to satellite1 planet10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet10)
   goals met: 5 of 12
11. (take_image satellite1 planet10 instrument1 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 6 of 12
12. (turn_to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 12
13. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 7 of 12
14. (turn_to satellite1 star7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star7)
   goals met: 7 of 12
15. (take_image satellite1 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 8 of 12
16. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 8 of 12
17. (take_image satellite1 star8 instrument1 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 9 of 12
18. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 9 of 12
19. (take_image satellite1 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 12
20. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 11 of 12
21. (take_image satellite1 star5 instrument1 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 12 of 12
